Repository: CosmicFish/CosmicFish
Catalog: bundled/numdiff/po/numdiff/*.po
Languages: it

source: the decimal point (`%c'), or the thousands separator (`%c')
it: il punto decimale (`%c'), o il separatore delle migliaia (`%c')

source: The numeric format specified for the second file is illegal,
it: Il formato numerico specificato per il secondo file è inaccettabile,

source: The numeric format specified for the second file is illegal:
it: Il formato numerico specificato per il secondo file è inaccettabile:

source: Fatal error occurred during comparison of two numerical fields
it: Si è verificato un errore inemendabile durante il confronto di due campi numerici

source: memory exhausted
it: memoria esaurita
