Repository: CosmicFish/CosmicFish
Catalog: bundled/numdiff/po/numdiff/*.po
Languages: it

source: @ Line %lu in file "%s" contains too many fields to be properly processed!
it: @ La linea %lu nel file "%s" contiene troppi campi per essere elaborata correttamente!

source: @ Line %lu in file "%s" is shorter than expected!
it: @ La linea %lu nel file "%s" è più corta del previsto

source: *** File "%s" is binary, *** cannot read from it
it: *** Il file "%s" è un file binario, *** non è possibile leggere dati da esso

source: *** Error while reading from file "%s"
it: *** Errore in lettura dal file "%s"

source: *** Out of memory while reading from file "%s"
it: *** Esaurimento di memoria durante la lettura del file "%s"

source: *** End of file "%s" reached while trying to read line %lu.
it: *** Raggiunta la fine del file "%s" *** mentre si cercava di leggere la linea %lu.

source: *** File "%s" has more lines than file "%s",
it: *** Il file "%s" ha più linee del file "%s",

source: *** line %lu is the last one read from file "%s"
it: *** la linea %lu è l'ultima letta dal file "%s"

source: Unknown system error
it: Errore di sistema sconosciuto

source: %s: insufficient memory for new allocation, the execution of the program ends now
it: %s: memoria insufficiente per nuova assegnazione, l'esecuzione del programma finisce qui

source: Runtime error: %s
it: Errore durante l'esecuzione del programma: %s

source: Runtime warning: %s
it: Avvertimento lanciato durante l'esecuzione del programma: %s

source: <The array is empty>
it: <L'array è vuoto>

source: %s: option `%s' is ambiguous
it: %s: l'opzione `%s' è ambigua

source: %s: option `--%s' doesn't allow an argument
it: %s: l'opzione `--%s' non vuole argomenti

source: %s: option `%c%s' doesn't allow an argument
it: %s: l'opzione `%c%s' non vuole argomenti

source: %s: option `%s' requires an argument
it: %s: l'opzione `%s' ha bisogno di un argomento

source: %s: unrecognized option `--%s'
it: %s: l'opzione `--%s' risulta sconosciuta

source: %s: unrecognized option `%c%s'
it: %s: l'opzione `%c%s' risulta sconosciuta

source: %s: illegal option -- %c
it: %s: opzione inammissibile -- %c

source: %s: invalid option -- %c
it: %s: opzione non valida -- %c

source: %s: option requires an argument -- %c
it: %s: opzione con argomento obbligatorio -- %c

source: %s: option `-W %s' is ambiguous
it: %s: l'opzione `-W %s' è ambigua

source: %s: option `-W %s' doesn't allow an argument
it: %s: l'opzione `-W %s' non vuole argomenti

source: *** Fatal error occurred in function %s: %s
it: *** Errore non emendabile verificatosi durante *** l'esecuzione della funzione %s: %s

source: *** a very long line has been encountered which contains *** too many fields to be correctly handled
it: *** È stata incontrata una linea molto lunga che contiene *** troppi campi per poter essere elaborata correttamente

source: @ Absolute error =
it: @ Errore assoluto =

source: , Relative error =
it: , Errore relativo =

source: In the computation of the following quantities only the errors with positive sign are considered:
it: Nel calcolo dei seguenti valori vengono considerati solo gli errori con segno positivo:

source: differences due to numeric fields of the second file that are less than the corresponding fields in the first file are neglected
it: le differenze dovute a campi numerici del secondo file che risultano essere minori dei corrispondenti campi del primo file sono state tralasciate

source: In the computation of the following quantities only the errors with negative sign are considered:
it: Nel calcolo dei seguenti valori vengono considerati solo gli errori con segno negativo:

source: differences due to numeric fields of the second file that are greater than the corresponding fields in the first file are neglected
it: le differenze dovute a campi numerici del secondo file che risultano essere maggiori dei corrispondenti campi del primo file sono state tralasciate

source: No numeric comparison has been done
it: Non è stato effettuato alcun confronto numerico

source: One numeric comparison has been done and the resulting numeric difference is negligible
it: È stato effettuato un solo confronto numerico e la differenza numerica rilevata è trascurabile

source: One numeric comparison has been done and has produced an outcome beyond the tolerance threshold
it: È stato effettuato un solo confronto numerico e ha prodotto un risultato oltre la soglia di tolleranza

source: One numeric comparison has been done,
it: È stato effettuato un solo confronto numerico,

source: only one numeric comparison has produced an outcome beyond the tolerance threshold
it: un solo confronto numerico ha prodotto un risultato oltre la soglia di tolleranza

source: Largest absolute error in the set of relevant numerical differences:
it: Massimo errore assoluto nell'insieme delle differenze numeriche rilevanti:

source: Corresponding relative error:
it: Corrispondente errore relativo:

source: Largest relative error in the set of relevant numerical differences:
it: Massimo errore relativo nell'insieme delle differenze numeriche rilevanti:

source: Corresponding absolute error:
it: Corrispondente errore assoluto:

source: Sum of all absolute errors:
it: Somma degli errori assoluti:

source: Sum of the relevant absolute errors:
it: Somma degli errori assoluti non trascurabili:

source: Arithmetic mean of all absolute errors:
it: Media aritmetica degli errori assoluti:

source: Arithmetic mean of the relevant absolute errors:
it: Media aritmetica degli errori assoluti non trascurabili:

source: Square root of the sum of the squares of all absolute errors:
it: Radice quadrata della somma dei quadrati di tutti gli errori assoluti:

source: Quadratic mean of all absolute errors:
it: Media quadratica degli errori assoluti:

source: Square root of the sum of the squares of the relevant absolute errors:
it: Radice quadrata della somma dei quadrati di tutti gli errori assoluti non trascurabili:

source: Quadratic mean of the relevant absolute errors:
it: Media quadratica degli errori assoluti non trascurabili:

source: *** %s: memory exhausted
it: *** %s: memoria esaurita

source: *** The requested comparison cannot be performed:
it: *** Il confronto richiesto non può essere effettuato:

source: *** At least one between "%s" and "%s" is a binary file
it: *** Almeno uno tra "%s" e "%s" è un file binario

source: +++ Files "%s" and "%s" have the same structure
it: +++ I file "%s" e "%s" hanno la stessa struttura

source: +++ Files "%s" and "%s" are equal
it: +++ I file "%s" e "%s" sono uguali

source: +++ File "%s" differs from file "%s"
it: +++ Il file "%s" differisce dal file "%s"

source: %s: a number with a too small exponent has been found, namely "%s".
it: %s: è stato trovato un numero con un esponente troppo basso, precisamente "%s".

source: Exponents smaller than %ld are not accepted,
it: Esponenti inferiori a %ld non sono accettati,

source: the execution of the program ends now
it: l'esecuzione del programma finisce qui

source: %s: a number with a too large exponent has been found, namely "%s".
it: %s: è stato trovato un numero con un esponente troppo alto, precisamente "%s".

source: Exponents larger than %ld are not accepted,
it: Esponenti superiori a %ld non sono accettati,

source: power with non integral base
it: potenza con base non intera

source: power with non integral exponent
it: potenza con esponente non intero

source: modulus is not an integral value
it: il modulo non è un valore intero

source: exponent too large in raise
it: potenza con esponente troppo grande

source: The string "%s" is not a valid number, the execution of the program ends now
it: La stringa "%s" non è un numero valido, l'esecuzione del programma finisce qui

source: License GPLv3+: GNU GPL version 3 or later, see <http://gnu.org/licenses/gpl.html>. This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
it: Licenza GPLv3+: GNU GPL versione 3 o successiva, vedi <http://gnu.org/licenses/gpl.html>. Questo è software libero: sei libero di modificarlo e redistribuirlo. NON c'è NESSUNA GARANZIA, per quanto consentito dalle vigenti normative.

source: The software has been linked against the GNU Multiple Precision Arithmetic Library, version number
it: Il software è stato linkato alla libreria GNU per l'aritmetica a precisione multipla (GNU MP), numero di versione

source: The software has been built with its own internal support for multiple precision arithmetic
it: Il software è stato compilato attivando il suo supporto interno per l'aritmetica a precisione multipla

source: Usage:
it: Uso:

source: or
it: oppure

source: Compare putatively similar files line by line and field by field, ignoring small numeric differences or/and different numeric formats.
it: Confronta file grossolanamente simili linea per linea e campo per campo, ignorando piccole differenze numeriche o/e formati numerici differenti.

source: RANGE, RANGE1 and RANGE2 stay for a positive integer value or for a range of integer values, like 1-, 3-5 or -7.
it: RANGE, RANGE1 e RANGE2 stanno per un valore intero positivo oppure per un intervallo di valori interi, per esempio 1-, 3-5 or -7.

source: The two arguments after the options are the names of the files to compare.
it: I due argomenti dopo le opzioni sono i nomi dei file da confrontare.

source: The complete paths of the files should be given, a directory name is not accepted.
it: È bene fornire i percorsi completi dei file, un nome di cartella non viene accettato.

source: The given paths cannot refer to the same file but one of them can be "-", which refers to stdin.
it: I file non possono coincidere ma uno di loro può essere "-", che si riferisce allo standard input.

source: Exit status: 1 if files differ, 0 if they are equal, -1 (255) in case of error
it: Codice di uscita: 1 se i file sono diversi, 0 se uguali, -1 (255) su errore

source: Specify the set of characters to use as delimiters while splitting the input lines into fields
it: Specifica l'insieme dei caratteri da usare come separatori al momento di suddividere le linee di input in campi

source: (The default set of delimiters is space, tab and newline).
it: (L'insieme predefinito è spazio bianco, tabulazione e nuova linea).

source: If IFS is prefixed with 1: or 2: then use the given delimiter set only for the lines from the first or the second file respectively
it: Se IFS è preceduto dal prefisso 1: o da 2: allora usa l'insieme di caratteri specificato solo per le linee del primo ovvero del secondo file

source: Specify the set of strings to use as delimiters while splitting the input lines into fields
it: Specifica l'insieme delle stringhe da usare come separatori al momento di suddividere le linee di input in campi

source: If DELIMS is prefixed with 1: or 2: then use the given delimiter set only for the lines from the first or the second file respectively
it: Se DELIMS è preceduto dal prefisso 1: o da 2: allora usa l'insieme di stringhe specificato solo per le linee del primo ovvero del secondo file

source: Set to THRVAL the maximum absolute difference permitted before that two numeric fields are regarded as different (The default value is zero).
it: Imposta al valore THRVAL la massima differenza assoluta consentita prima che due campi numerici siano considerati diversi (Il valore predefinito è zero).

source: If a RANGE is given, use the specified threshold only when comparing fields whose positions lie in RANGE.
it: Se un solo RANGE è dato, usa il valore di soglia specificato solo per confrontare campi le cui posizioni cadono dentro RANGE.

source: If both RANGE1 and RANGE2 are given and have the same length, then use the specified threshold when comparing a field of FILE1 lying in RANGE1 with the corresponding field of FILE2 in RANGE2
it: Se sono dati sia RANGE1 che RANGE2 ed hanno la stessa lunghezza, usa il valore di soglia specificato quando confronti un campo di FILE1 che cade in RANGE1 con il corrispondente campo di FILE2 in RANGE2

source: Set to THRVAL the maximum relative difference permitted before that two numeric fields are regarded as different (The default value is zero).
it: Imposta al valore THRVAL la massima differenza relativa consentita prima che due campi numerici siano considerati diversi (Il valore predefinito è zero).

source: Consider two numerical values as equal only if both absolute and relative difference do not exceed the corresponding tolerance threshold
it: Considera due campi numerici come uguali solo se la differenza assoluta e quella relativa sono entrambe dentro la corrispondente soglia di tolleranza

source: Use the formula indicated by NUM to compute the relative errors.
it: Usa la formula indicata da NUM per calcolare gli errori relativi.

source: If 'NUM' is 0 use the classic formula.
it: Se 'NUM' è 0 usa la formula classica.

source: If 'NUM' is 1 compute the relative errors by considering the values in FILE1 as sample values.
it: Se 'NUM' è 1 calcola gli errori relativi considerando i valori in FILE1 come valori campione.

source: If 'NUM' is 2 compute the relative errors by considering the values in FILE2 as sample values.
it: Se 'NUM' è 2 calcola gli errori relativi considerando i valori in FILE2 come valori campione.

source: Set to NUM the number of digits in the significands used in multiple precision arithmetic
it: Imposta a NUM il numero di cifre significative usate nell'aritmetica a precisione multipla

source: Ignore all differences due to numeric fields of the second file that are less than the corresponding numeric fields in the first file
it: Ignora tutte le differenze dovute a campi numerici del secondo file che sono minori dei corrispondenti campi numerici nel primo file

source: Ignore all differences due to numeric fields of the second file that are greater than the corresponding numeric fields in the first file
it: Ignora tutte le differenze dovute a campi numerici del secondo file che sono maggiori dei corrispondenti campi numerici nel primo file

source: Ignore changes in case while doing literal comparisons
it: Nel fare confronti letterali ignora le differenze del tipo maiuscolo/minuscolo

source: Set to CURRNAME the currency name for the two files to compare.
it: Imposta a CURRNAME il nome della valuta per i due file da confrontare.

source: CURRNAME must be prefixed with 1: or 2: to specify the currency name only for the first or the second file
it: CURRNAME deve essere preceduto dal prefisso 1: o 2: per specificare il nome della valuta solo per il primo ovvero per il secondo file

source: Specify the characters representing the decimal point in the two files to compare
it: Specifica i caratteri rappresentanti il punto decimale nei due file da confrontare

source: Specify the characters representing the thousands separator in the two files to compare
it: Specifica i caratteri rappresentanti il separatore delle migliaia nei due file da confrontare

source: Specify the number of digits forming each group of thousands in the two files to compare
it: Specifica il numero di cifre che formano ogni gruppo di migliaia nei due file da confrontare

source: Specify the (optional) prefixes for positive values used in the two files to compare
it: Specifica i prefissi (opzionali) per valori positivi usati nei due file da confrontare

source: Specify the prefixes for negative values used in the two files to compare
it: Specifica i prefissi per valori negativi usati nei due file da confrontare

source: Specify the exponent letters used in the two files to compare
it: Specifica i simboli che precedono l'esponente decimale nei due file da confrontare

source: Specify the characters representing the imaginary unit in the two files to compare
it: Specifica i caratteri rappresentanti l' unità immaginaria nei due file da confrontare

source: Select the fields of the first file that have to be ignored
it: Seleziona i campi del primo file che devono essere ignorati

source: Select the fields of the second file that have to be ignored
it: Seleziona i campi del secondo file che devono essere ignorati

source: While printing the differences between the two compared files show only the numerical ones
it: Nello stampare le differenze tra i due file confrontati mostra solo quelle di tipo numerico

source: While printing the differences between the two compared files neglect all the numerical ones (dummy mode)
it: Nello stampare le differenze tra i due file confrontati trascura tutte quelle di tipo numerico (modalità stupida)

source: Suppress all messages concerning the differences discovered in the structures of the two files
it: Sopprimi tutti i messaggi relativi alle differenze scoperte nelle strutture dei due file

source: For every couple of lines which differ in at least one field print an header to show how these lines appear in the two compared files
it: Per ogni coppia di linee che differiscono in almeno un campo stampa una intestazione per mostrare come esse appaiono nei due file confrontati

source: Display a side by side difference listing of the two files showing which lines are present only in one file, which lines are present in both files but with one or more differing fields, and which lines are identical.
it: Stampa un elenco a colonne affiancate delle differenze tra i due file, mostrando quali linee sono presenti solo in un file, quali linee sono presenti in entrambi i file ma con uno o più campi differenti e quali sono identiche.

source: If 'NUM' is zero or is not specified, output at most 130 columns per line.
it: Se 'NUM' è zero o non è specificato, visualizza al più 130 colonne per linea.

source: If 'NUM' is a positive number, output at most 'NUM' columns per line.
it: Se 'NUM' è un numero positivo, visualizza al più 'NUM' colonne per linea.

source: If 'NUM' is a negative number, do not output common lines and display at most -'NUM' columns per line.
it: Se 'NUM' è un numero negativo, non stampare le linee comuni ai due file e visualizza al più -'NUM' colonne per linea.

source: Suppress all the standard output
it: Sopprimi completamente l'output standard del programma

source: Add some statistics to the standard output
it: Aggiungi alcune informazioni di tipo statistico all'output standard

source: Select the fields of the first file that have to be blurred during the synchronization procedure only if they turn out to be numeric
it: Seleziona i campi del primo file che devono essere offuscati durante la procedura di sincronizzazione quando risultano essere di tipo numerico

source: Select the fields of the second file that have to be blurred during the synchronization procedure only if they turn out to be numeric
it: Seleziona i campi del secondo file che devono essere offuscati durante la procedura di sincronizzazione quando risultano essere di tipo numerico

source: Select the fields of the first file that have to be unconditionally blurred during the synchronization procedure
it: Seleziona i campi del primo file che devono essere sempre offuscati durante la procedura di sincronizzazione

source: Select the fields of the second file that have to be unconditionally blurred during the synchronization procedure
it: Seleziona i campi del secondo file che devono essere sempre offuscati durante la procedura di sincronizzazione

source: During synchronization try hard to find a smaller set of changes
it: Durante la sincronizzazione cerca ad ogni costo di trovare una catena minimale di modifiche

source: During synchronization assume large files and many scattered small changes
it: Durante la sincronizzazione assumi di lavorare su file grandi con tante piccole differenze sparpagliate

source: Run only the filter and then show the results of its attempt to synchronize the two files.
it: Esegui solo il filtraggio e quindi mostra i risultati del suo tentativo di sincronizzare i due file.

source: Expand tabs to spaces in output while displaying the results of the synchronization procedure (meaningful only together with option -O or -f)
it: Espandi le tabulazioni a spazi bianchi mentre stampi i risultati della procedura di sincronizzazione (utile solo con le opzioni -O e -f)

source: Treat both files as binary files (only meaningful under Doz/Windoz)
it: Tratta entrambi i file come binari (utile solo sotto Doz/Windoz)

source: Redirect warning and error messages from stderr to the indicated file
it: Reindirizza avvertimenti e messaggi di errore dallo standard error (schermo) al file indicato

source: Redirect output from stdout to the indicated file
it: Reindirizza l'output dallo standard output (schermo) al file indicato

source: Show help message and predefined settings
it: Mostra questo messaggio di aiuto e le impostazioni predefinite

source: Show version number, Copyright, Distribution Terms and NO-Warranty
it: Mostra numero di versione, Copyright, termini di distribuzione e NON-Garanzia

source: Default numeric format (for both files to compare):
it: Formato numerico predefinito (per entrambi i file da confrontare):

source: Currency name = "%s"
it: Nome della valuta = "%s"

source: Decimal point = `%c'
it: Punto decimale = `%c'

source: Thousands separator = `%c'
it: Separatore delle migliaia = `%c'

source: Number of digits in each thousands group = %u
it: Numero di cifre in ogni gruppo di migliaia = %u

source: Leading positive sign = `%c'
it: Segno iniziale per numeri positivi = `%c'

source: Leading negative sign = `%c'
it: Segno iniziale per numeri negativi = `%c'

source: Prefix for decimal exponent = `%c'
it: Prefisso per esponente decimale = `%c'

source: Symbol used to denote the imaginary unit = `%c'
it: Simbolo usato per indicare l'unità immaginaria = `%c'

source: %s: invalid argument after `-%c' option
it: %s: un argomento non valido segue l'opzione `-%c'

source: %s: memory exhausted
it: %s: memoria esaurita

source: %s: invalid argument after `-%c' option:
it: %s: un argomento non valido segue l'opzione `-%c':

source: The list of field delimiters can not be empty and must always include the newline character ('\n')
it: La lista di separatori di campo non può essere vuota e deve sempre includere il carattere di nuova linea ('\n')

source: The list of field delimiters cannot be empty and must always include the newline string ("\n"). Care that the newline character cannot appear in any other delimiter than the newline string
it: La lista di separatori di campo non può essere vuota e deve sempre includere la stringa di nuova linea ("\n"). Inoltre, il carattere di nuova linea non può apparire in alcun altro separatore di campo

source: The format specification has not been respected
it: La specifica di formato non è stata rispettata

source: The specified ranges do not have the same length
it: Gli intervalli specificati non hanno la stessa lunghezza

source: you have missed to specify the currency name
it: hai dimenticato di specificare il nome della valuta

source: %s: cannot open file "%s":
it: %s: impossibile aprire il file "%s":

source: The numeric format specified for the first file is illegal,
it: Il formato numerico specificato per il primo file è inaccettabile,

source: the following symbols should be all different while two or more of them are actually equal:
it: i simboli seguenti dovrebbero essere tutti diversi mentre due o più di essi sono in realtà uguali:

source: Decimal point = `%c'
it: Punto decimale = `%c'

source: The numeric format specified for the first file is illegal:
it: Il formato numerico specificato per il primo file è inaccettabile:

source: the name of the currency may not contain digits,
it: il nome della valuta non può contenere cifre numeriche,

source: the symbol for the leading positive sign (`%c'),
it: il prefisso per numeri positivi (`%c'),

source: the symbol for the leading negative sign (`%c'),
it: il prefisso per numeri negativi (`%c'),
